## Agregacion de datos por categoria

In [1]:
import pandas as pd
import numpy as np

In [2]:
gender = ['Male', 'Female']
income = ['Poor', 'Middle Class', 'Rich']

In [3]:
n = 500
gender_data = [np.random.choice(gender) for _ in range(n)]
income_data = [np.random.choice(income) for _ in range(n)]

In [5]:
#  z => N(0, 1)
#  N(m, s) => m + s * z
height = 160 + 30 * np.random.randn(n)
weight = 60 + 25 * np.random.randn(n)
age = 30 + 12 * np.random.randn(n)
income = 18000 + 3500 * np.random.randn(n)

In [7]:
data = pd.DataFrame(
    {
        'gender': gender_data,
        'Economic Status': income_data,
        'height': height,
        'weight': weight,
        'age':age,
        'income':income
    }
)

In [8]:
data.head()

   gender Economic Status      height     weight        age        income
0  Female            Poor  174.508459  63.032251  39.405078  16979.958304
1    Male            Rich  139.005251  68.515674  43.349345  26127.912633
2  Female    Middle Class  195.494070  81.663611  10.090042  19020.022127
3    Male    Middle Class  160.248382  67.341003  32.955919  19690.685800
4  Female            Rich  171.834447  50.102432  15.949489  20729.917822

## Agrupaci√≥n de datos

In [11]:
grouped_gender = data.groupby('gender')

In [12]:
grouped_gender.groups

{'Female': [0, 2, 4, 5, 7, 8, 12, 13, 14, 15, 17, 20, 23, 24, 26, 28, 31, 32, 34, 35, 37, 41, 42, 45, 47, 48, 49, 54, 56, 59, 60, 61, 62, 63, 65, 68, 69, 70, 71, 73, 74, 75, 76, 77, 79, 82, 86, 87, 88, 92, 93, 99, 101, 102, 104, 105, 107, 108, 110, 111, 112, 115, 117, 120, 121, 122, 123, 124, 128, 131, 132, 133, 138, 142, 144, 146, 150, 151, 153, 158, 159, 166, 168, 172, 173, 175, 177, 178, 179, 181, 184, 186, 187, 197, 200, 201, 202, 205, 206, 208, ...], 'Male': [1, 3, 6, 9, 10, 11, 16, 18, 19, 21, 22, 25, 27, 29, 30, 33, 36, 38, 39, 40, 43, 44, 46, 50, 51, 52, 53, 55, 57, 58, 64, 66, 67, 72, 78, 80, 81, 83, 84, 85, 89, 90, 91, 94, 95, 96, 97, 98, 100, 103, 106, 109, 113, 114, 116, 118, 119, 125, 126, 127, 129, 130, 134, 135, 136, 137, 139, 140, 141, 143, 145, 147, 148, 149, 152, 154, 155, 156, 157, 160, 161, 162, 163, 164, 165, 167, 169, 170, 171, 174, 176, 180, 182, 183, 185, 188, 189, 190, 191, 192, ...]}

In [13]:
for group, names in grouped_gender:
    print(group)
    print(names)

Female
     gender Economic Status      height     weight        age        income
0    Female            Poor  174.508459  63.032251  39.405078  16979.958304
2    Female    Middle Class  195.494070  81.663611  10.090042  19020.022127
4    Female            Rich  171.834447  50.102432  15.949489  20729.917822
5    Female    Middle Class  182.532627  43.339614  35.843406  17926.142128
7    Female            Poor  167.421869  61.516701  44.682690  16346.654543
..      ...             ...         ...        ...        ...           ...
492  Female            Poor  176.931420  64.229267  23.168778  17207.410306
493  Female    Middle Class  189.587755  16.199520  17.999666  16876.349164
495  Female    Middle Class  173.774401  30.362480  33.355392  16006.562862
496  Female    Middle Class  189.328384  90.514001  10.048495  16231.308053
498  Female            Poor  156.960086  95.822759  36.333346  21786.694301

[254 rows x 6 columns]
Male
    gender Economic Status      height     weight        age        income
1     Male            Rich  139.005251  68.515674  43.349345  26127.912633
3     Male    Middle Class  160.248382  67.341003  32.955919  19690.685800
6     Male    Middle Class  163.487767  87.531793  54.604757  12837.658626
9     Male            Poor  178.674410  41.560327  41.666653  21566.027369
10    Male    Middle Class   97.254673  56.691182  40.857442  20781.610611
..     ...             ...         ...        ...        ...           ...
490   Male            Poor  175.102228  53.953903  16.232941  17874.616947
491   Male            Poor  162.109946  77.980959  12.889198  22401.534400
494   Male    Middle Class  171.048004  66.945817  61.927953  13040.592328
497   Male    Middle Class  181.634183  66.783581  18.439316  12402.035988
499   Male            Poor  197.612108  90.774023  48.248255  19214.151217

[246 rows x 6 columns]

In [14]:
grouped_gender.get_group("Female")

     gender Economic Status      height     weight        age        income
0    Female            Poor  174.508459  63.032251  39.405078  16979.958304
2    Female    Middle Class  195.494070  81.663611  10.090042  19020.022127
4    Female            Rich  171.834447  50.102432  15.949489  20729.917822
5    Female    Middle Class  182.532627  43.339614  35.843406  17926.142128
7    Female            Poor  167.421869  61.516701  44.682690  16346.654543
..      ...             ...         ...        ...        ...           ...
492  Female            Poor  176.931420  64.229267  23.168778  17207.410306
493  Female    Middle Class  189.587755  16.199520  17.999666  16876.349164
495  Female    Middle Class  173.774401  30.362480  33.355392  16006.562862
496  Female    Middle Class  189.328384  90.514001  10.048495  16231.308053
498  Female            Poor  156.960086  95.822759  36.333346  21786.694301

[254 rows x 6 columns]

In [15]:
double_group = data.groupby(['gender', 'Economic Status'])
double_group

In [16]:
double_group.groups

{('Female', 'Middle Class'): [2, 5, 8, 20, 26, 32, 35, 42, 49, 54, 59, 68, 69, 73, 77, 86, 101, 110, 115, 117, 120, 124, 144, 158, 159, 166, 172, 173, 175, 201, 206, 209, 223, 227, 231, 232, 233, 235, 238, 248, 255, 256, 268, 274, 275, 278, 283, 285, 286, 298, 300, 307, 311, 314, 315, 316, 322, 340, 341, 345, 357, 358, 365, 370, 373, 377, 378, 388, 402, 410, 422, 423, 428, 431, 435, 441, 444, 448, 452, 453, 458, 466, 468, 473, 474, 493, 495, 496], ('Female', 'Poor'): [0, 7, 13, 14, 15, 28, 31, 45, 47, 56, 60, 62, 71, 75, 76, 82, 87, 88, 99, 104, 105, 108, 121, 122, 123, 128, 132, 133, 142, 146, 150, 168, 187, 200, 205, 208, 216, 225, 229, 237, 239, 242, 243, 247, 260, 262, 266, 277, 291, 293, 302, 303, 329, 330, 336, 343, 347, 348, 349, 351, 359, 363, 366, 381, 385, 389, 408, 413, 414, 419, 429, 437, 438, 440, 442, 443, 447, 460, 462, 463, 471, 472, 478, 492, 498], ('Female', 'Rich'): [4, 12, 17, 23, 24, 34, 37, 41, 48, 61, 63, 65, 70, 74, 79, 92, 93, 102, 107, 111, 112, 131, 138, 151, 153, 177, 178, 179, 181, 184, 186, 197, 202, 213, 214, 228, 230, 240, 252, 253, 254, 257, 280, 281, 284, 288, 289, 296, 299, 309, 312, 313, 317, 320, 326, 331, 353, 380, 382, 384, 387, 390, 398, 400, 401, 405, 412, 417, 418, 432, 451, 456, 464, 465, 467, 479, 480, 485, 486, 487, 489], ('Male', 'Middle Class'): [3, 6, 10, 11, 16, 18, 21, 22, 25, 27, 36, 39, 43, 44, 51, 53, 58, 66, 67, 81, 83, 106, 114, 116, 125, 129, 136, 139, 141, 145, 148, 149, 154, 155, 156, 160, 167, 170, 171, 185, 188, 189, 190, 191, 192, 194, 199, 207, 211, 218, 221, 224, 226, 236, 241, 245, 258, 261, 263, 264, 265, 270, 271, 272, 295, 305, 319, 325, 332, 334, 342, 344, 352, 354, 360, 368, 371, 379, 383, 386, 395, 399, 416, 421, 424, 425, 427, 430, 436, 439, 445, 454, 457, 470, 475, 477, 484, 494, 497], ('Male', 'Poor'): [9, 19, 29, 30, 38, 46, 50, 52, 55, 57, 78, 80, 90, 94, 96, 98, 100, 103, 113, 118, 126, 137, 140, 143, 147, 152, 161, 162, 169, 176, 180, 182, 183, 193, 198, 204, 210, 212, 219, 222, 234, 244, 249, 251, 273, 279, 287, 290, 297, 304, 306, 308, 321, 324, 335, 337, 338, 350, 356, 375, 391, 393, 394, 396, 404, 409, 411, 433, 449, 455, 459, 469, 483, 488, 490, 491, 499], ('Male', 'Rich'): [1, 33, 40, 64, 72, 84, 85, 89, 91, 95, 97, 109, 119, 127, 130, 134, 135, 157, 163, 164, 165, 174, 195, 196, 203, 215, 217, 220, 246, 250, 259, 267, 269, 276, 282, 292, 294, 301, 310, 318, 323, 327, 328, 333, 339, 346, 355, 361, 362, 364, 367, 369, 372, 374, 376, 392, 397, 403, 406, 407, 415, 420, 426, 434, 446, 450, 461, 476, 481, 482]}